<?php

// ********************************************************
// class
// ********************************************************

// html title
$title = 'title';
// header
$headerName = 'feris nyannyan';
$nav = [
    'Story', 'Character', 'Works', 'Links'
];
// main
$mainH1 = ['働きたくないです。今日も酒が美味い', 'お金ください、休みください、サボりたいです、不労所得ください。'];
// article
$article = [
    'Story', 'Character', 'career', 'Works',
];
$article['Story'] = [
    '人が苦手でゲームばかりしていたferisちゃん。',
    '社会復帰する為に接客業を志すも体力も気力も無く',
    '気疲れしてしまい、エンジニアを目指す事に。',
    '無駄が多い生き方...それも人生()'
];
$article['Character'] = [
    'HAL大阪IT学部WEB開発学科に通う2年生。',
    '小さい頃もあまり人の話を聞かなかったらしい',
    '最近もあまり聞いていないが聞こうと努力はしているらしい。',
    '好きな事は模倣、本、可愛い、音楽。',
    'soundcloudでremixされた良曲を探しつつよく聞いている。',
    '@tonari_machi_を推している。',
    '意識しないとすぐサボりがち',
    '年取ってガタがこないような真っ当な人間を目指したい()',
    'Qualitification',
    '基本情報技術者 合格',
    '日本漢字検定2級 合格',
    '日本英語検定2級 合格'
];
$article['career'] = [
    '(1995)' => '生まれる',
    '(2011)' => '履正社高校へ',
    '(2013)' => '履正社高校中退(入学時偏差値70あったものの落ちていった)',
    '(2013)' => 'つくば開成高校転入(1日4限の人生夏休み開始)',
    '(2014)' => '中部大学入学(遊ぶのもどこか開き直れず、中途半端な感じ)',
    '(2015/10)' => '中部大学中退 バイトしていた喫茶店で店員に。',
    '(2016/2)' => 'お客さんの世話になりすぎてこのままでは駄目だと思い大阪に戻ることに',
    '(2017)' => 'バイトを何個かやっていく間に先輩に誘われ新聞屋に就職する事に。',
    '(2019)' => '出前館、佐川急便の事業の提携の話が出てくるものの体力的に持たなくなってきた為退職。某アプリであった女の子にスマホのサポートサービスの仕事を紹介され働き始める。',
    '(2020~)' => 'HAL大阪入学'
];
$article['Works'] = 'to be continued...';

$footer = '© 2021 feris';

require_once 'tpl/p01.php';
